<a href="https://colab.research.google.com/github/alsantosad/Projeto5-Analise-de-pessoas-deixando-o-trabalho/blob/main/Analise_de_Pessoas_deixando_a_Empresa.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# ***PROJETO INDIVIDUAL***
>Módulo 5 – Pessoas deixando a empresa

### **Importando Bibliotecas e Dados**

In [43]:
pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: openpyxl in c:\users\47131502023.1\appdata\roaming\python\python311\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\47131502023.1\appdata\roaming\python\python311\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [44]:
import pandas as pd

In [45]:
url = ('https://github.com/alsantosad/Projeto5-Analise-de-pessoas-deixando-o-trabalho/raw/main/Data/%5BSE%5D%20%5BM5%5D%20Projeto%20Individual%20-%20FONTE%20DE%20DADOS.xlsx')

# Read the Excel file from the URL
df = pd.read_excel(url)

### **Analise Exploratória**

#### ***Entendendo os Dados***

In [46]:
df.head()

   Unnamed: 0 Unnamed: 1         Unnamed: 2 Unnamed: 3   Unnamed: 4
0         NaN        NaN                NaN        NaN          NaN
1         NaN      Dados                NaN        NaN          NaN
2         NaN        NaN                NaN        NaN          NaN
3         NaN        NaN  Ability to impact       HRBP  Exit survey
4         NaN   Training                 11         31           23

In [47]:
df.dtypes

Unnamed: 0    float64
Unnamed: 1     object
Unnamed: 2     object
Unnamed: 3     object
Unnamed: 4     object
dtype: object

In [48]:
df.describe()

       Unnamed: 0
count         0.0
mean          NaN
std           NaN
min           NaN
25%           NaN
50%           NaN
75%           NaN
max           NaN

In [49]:
df.isnull()

    Unnamed: 0  Unnamed: 1  Unnamed: 2  Unnamed: 3  Unnamed: 4
0         True        True        True        True        True
1         True       False        True        True        True
2         True        True        True        True        True
3         True        True       False       False       False
4         True       False       False       False       False
5         True       False       False       False       False
6         True       False       False       False       False
7         True       False       False       False       False
8         True       False       False       False       False
9         True       False       False       False       False
10        True       False       False       False       False
11        True       False       False       False       False
12        True       False       False       False       False
13        True       False       False       False       False
14        True       False       False       False       False

In [50]:
df.shape

(15, 5)

### ***Limpando os Dados***

In [51]:
# Dropamos a primeira coluna com valores inutilizaveis
df.drop(df.columns[0], axis=1, inplace=True)

In [52]:
# Corrigimos as posições das colunas
df.rename(columns={df.columns[0]: 'Dados', df.columns[1]: 'Ability to impact', df.columns[2]: 'HRBP', df.columns[3]: 'Exit Survey'}, inplace=True)

In [53]:
# Apagamos os valores nulos
df.dropna(inplace=True)

In [54]:
# Reindexamos para reiniciar o index
df.reset_index(drop=True, inplace=True)

In [55]:
# Exibindo o Dataframe
df

                   Dados Ability to impact HRBP Exit Survey
0               Training                11   31          23
1   Conflict with others                10   11          15
2    Lack of recognition                 9   65          44
3               Workload                 8   14          39
4     Career advancement                 7  137         171
5                    Pay                 6   16          24
6           Type of work                 5  128          78
7          Career change                 4   18          30
8                Commute                 3   31          22
9             Relocation                 2  105          37
10               Illness                 1    9          21

### ***Traduzindo todos os valores da Coluna Dados***

In [56]:
def traducao_colunas(df, column_name, translation_dict):
    """
    Função que traduz os valores de uma coluna do DataFrame de acordo com o dicionário de tradução fornecido.

    Args:
    df (DataFrame): O DataFrame que contém a coluna a ser traduzida.
    column_name (str): O nome da coluna a ser traduzida.
    traducao_dict (dict): Um dicionário onde as chaves são os valores originais da coluna
                             e os valores são as traduções correspondentes.

    Returns:
    DataFrame: O DataFrame com os valores da coluna traduzidos.
    """
    df[column_name] = df[column_name].map(traducao_dict)
    return df

In [57]:
# Dicionário de tradução para os valores da coluna "Dados"
traducao_dict = {
    'Training': 'Treinamento',
    'Conflict with others': 'Conflito com outros',
    'Lack of recognition': 'Falta de Reconhecimento',
    'Workload': 'Carga horária',
    'Career advancement': 'Progressão de carreira',
    'Pay': 'Remuneração',
    'Type of work': 'Tipo de trabalho',
    'Career change': 'Mudança de carreira',
    'Commute': 'Trajeto',
    'Relocation': 'Realocação',
    'Illness': 'Doença'
}

# Aplicando a tradução à coluna "Dados" do DataFrame
df_traduzido = traducao_colunas(df, 'Dados', traducao_dict)

# Exibindo o DataFrame com os valores traduzidos
df_traduzido

                      Dados Ability to impact HRBP Exit Survey
0               Treinamento                11   31          23
1       Conflito com outros                10   11          15
2   Falta de Reconhecimento                 9   65          44
3             Carga horária                 8   14          39
4    Progressão de carreira                 7  137         171
5               Remuneração                 6   16          24
6          Tipo de trabalho                 5  128          78
7       Mudança de carreira                 4   18          30
8                   Trajeto                 3   31          22
9                Realocação                 2  105          37
10                   Doença                 1    9          21

In [58]:
# Traduzindo as colunas Dados, Ability to impact, HRBP, Exit Survey
def translate_columns(df):
    df.rename(columns={'Dados': 'Razões de Saída', 'Ability to impact': 'Rank de Impacto', 'HRBP': 'Recursos Humanos(HRBP)',
                       'Exit Survey': 'Pesquisa de Saída'}, inplace=True)
    return df

In [59]:
df_traduzido = translate_columns(df_traduzido)

In [60]:
df_traduzido

,Razões de Saída,Rank de Impacto,Recursos Humanos(HRBP),Pesquisa de Saída
0,Treinamento,11,31,23
1,Conflito com outros,10,11,15
2,Falta de Reconhecimento,9,65,44
3,Carga horária,8,14,39
4,Progressão de carreira,7,137,171
5,Remuneração,6,16,24
6,Tipo de trabalho,5,128,78
7,Mudança de carreira,4,18,30
8,Trajeto,3,31,22
9,Realocação,2,105,37
10,Doença,1,9,21

### ***Extraindo os dados em Csv***

In [62]:
df_traduzido.to_csv('Data/FONTE DE DADOS.csv', index=False, encoding='iso-8859-1')
print('Fonte de dados traduzido com sucesso!')

Fonte de dados traduzido com sucesso!